In [1]:
#Importing the basic libraries
import numpy as np
import pandas as pd

In [3]:
#Importing the different datas, which are in csv format.
actor2013Data = pd.read_csv('Top 50 actors 2013.csv')
actor2021Data = pd.read_csv('Top 50 actors 2021.csv')
directorData = pd.read_csv('Top 50 directors.csv')
companyData = pd.read_csv('Top 10 production companies.csv')

In [4]:
#actor2013Data
actor2013Data.head()

   Rank Name of Actor/Actress
0     1           Johnny Depp
1     2             Al Pacino
2     3        Robert De Niro
3     4          Kevin Spacey
4     5     Denzel Washington

In [5]:
#actor2021Data
actor2021Data.head()

   Rank     Name of actor
0     1   Charles Chaplin
1     2     Marlon Brando
2     3    Jack Nicholson
3     4  Daniel Day-Lewis
4     5      Meryl Streep

In [6]:
#directorData
directorData.head()

   Rank      Name of Director
0     1      Steven Spielberg
1     2       Martin Scorsese
2     3  Francis Ford Coppola
3     4       Stanley Kubrick
4     5      Alfred Hitchcock

In [7]:
#companyData
companyData.head()

   Rank Name of Production Company  No. of Movies Total Worldwide Box Office
0   1.0         Universal Pictures          254.0            $43,913,150,146
1   2.0               Warner Bros.          249.0            $43,895,933,593
2   3.0          Columbia Pictures          245.0            $41,490,771,945
3   4.0       Walt Disney Pictures          130.0            $38,420,360,892
4   5.0             Marvel Studios           62.0            $33,686,093,642